Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.КомплексныйРасчетКлиента</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.Оплаты</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.омг_ОстаткиПредоплаты</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выдать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДокументу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомплексныйРасчетКлиента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресEmailЧек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиЧека</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприменениеККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоррекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеКоррекции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКоррекции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПредписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коррекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераЧековСторно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализацияЗатрат</Name>
					<Comment>Специализация-получатель затрат</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьАдрес</Name>
					<Comment>Адрес покупателя (клиента) (Тег 1254) – для расчетов между организациями (ИП).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеДанныеПокупателя</Name>
					<Comment>Реквизит кассового чека - Тэг 1256</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперационныйРеквизит</Name>
					<Comment>Реквизит кассового чека - Тэг 1270</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаЭТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_НомерСумки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_пломба</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_кассаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриПокупке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_Купюры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>cfg:EnumRef.омг_НоминалыКупюр</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПаспортныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствОтКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДенежныхСредствОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхВБанке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходныйКассовыйОрдер/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ 

&НаКлиенте
Перем мТекущаяДатаДокумента; // Хранит текущую дату документа - для проверки перехода документа в другой период установки номера.

&НаКлиенте
Перем РаспределитьНоменклатуруПоРазнымСНО Экспорт; // Флаг, отвечающий за перезапись документа с отбором номенклатур только под одной СНО

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаСервере
Процедура ДействияФормыДействиеУстановитьОперациюСервер()
	
	ОсновнаяПанель = Элементы.ГруппаОперации;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыСКонтрагентами Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаРасчетыСКонтрагентами;
		ЭУКлиент = Элементы.Контрагент;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствСотруднику Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаРасчетыССотрудниками;
		ЭУКлиент = Элементы.Сотрудник;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыСКлиентами Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаОплатаКлиенту;
		ЭУКлиент = Элементы.Клиент;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ПеремещениеВКассу Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаМеждуКассами;
		ЭУКлиент = Элементы.КассаПолучатель;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ПрочийРасходДенежныхСредств Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаПрочийРасход;
		ЭУКлиент = Неопределено;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
		ОсновнаяПанель.ТекущаяСтраница = ОсновнаяПанель.ПодчиненныеЭлементы.ГруппаВзносНаличнымиВБанк;
		ЭУКлиент = Неопределено;
	КонецЕсли;
	
	Если ЭУКлиент<>Неопределено Тогда
		мКлиент = ЭУКлиент.ОграничениеТипа.ПривестиЗначение(Объект.Контрагент);
		Если Объект.Контрагент <> мКлиент Тогда
			Объект.Контрагент = мКлиент;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПерезаполнитьПоДокументу.Видимость = Объект.ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыСКлиентами;
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	РаботаСФормамиКлиент.ДокументПриИзмененииДаты(ЭтаФорма, мТекущаяДатаДокумента);
	
КонецПроцедуры

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеСвойства = РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВыдачаДенежныхСредствСотруднику;
	КонецЕсли;
	
	УстановитьОграниченияТиповЭУ();
	ДействияФормыДействиеУстановитьОперациюСервер();
	
	НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Объект.Филиал, Истина, ОбщегоНазначенияБИТКлиентСервер.ЗаполненноеЗначение(Объект.ДатаПечатиЧека, Объект.Дата));
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьДепозитнуюОперациюККМ();
	КонецЕсли;
	
	ДоступныПолныеПрава = Пользователи.ЭтоПолноправныйПользователь();
	
	ПоместитьРеквизитыККТИзХЗвРеквизитыФормы();
	
	Элементы.КредитныеДанныеДобавитьСертификат.Видимость = Объект.ВидОперации = Перечисления.ВидыОперацийРКО.РасчетыСКлиентами;
	
	////////////////////////////////////////////////// 
	// ОМГ   
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОМГ_ПереЗаполнитьОрганизацию(); 
	КонецЕсли; 
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ЗаполнитьКупюры();	
		
		Если не ЗначениеЗаполнено(Объект.ДокументОснование) и РольДоступна("омг_Регистратор") Тогда
			
			Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк;
			Объект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Перемещение денежных средств между счетами, кассами (выбытие)");
			ДействияФормыДействиеУстановитьОперациюСервер();
		КонецЕсли;
		
		РеквизитыИнкасс();  
		
	КонецЕсли;	
	
	// ОМГ    
	/////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не РаботаСДокументамиКлиент.ФормаДокументаПриОткрытии(ЭтотОбъект, ДополнительныеСвойства) Тогда
		ЭтотОбъект.Закрыть();
		Возврат;
	КонецЕсли;
	
	УстановитьПараметрыВыбораСделки();
	мТекущаяДатаДокумента = Объект.Дата;
	
	Элементы.НадписьВалюта.Заголовок = глКраткоеНаименованиеОсновнойВалюты;
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	РаботаСДокументамиКлиент.ОбновитьВидимостьДоступностьСпособаРасчетаККМ(ЭтаФорма, Объект.ВидОперации, Объект.СпособРасчетаЧекаККМ, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.СогласоватьЗначенияРеквизитовПоСпособуРасчета(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	
	Если Объект.Ссылка.Пустая() Тогда
		РаботаСДокументамиКлиент.ПредложитьПерезаполнитьКредитныеДанныеПоСделкеДокумента(Объект, ЭтаФорма);
	КонецЕсли;
	
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ПлатежныйДокументПриОткрытииПроверкаНоменклатурыДоплатыНаНесколькоСНО(ЭтаФорма);
	
	КоррекцияПриИзменении("");
	
	Если Истина // ИспользоватьПодключаемоеОборудование Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	РаботаСДокументамиКлиент.ПлатежныйДокументПередЗаписьюНаФорме(ЭтотОбъект, Отказ, Объект, ПараметрыЗаписи, НастройкаПечатиЧеков)

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьРеквизитыККТИзРеквизитовФормыВХЗ(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Истина, ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствСотруднику") Тогда
		ПараметрыОповещения = Новый Структура("Получатель", Объект.Контрагент);
		Оповестить("РКОЗаписан", ПараметрыОповещения, Объект.Ссылка);
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПКО.ОплатаОтКлиента")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Сделка")
		И ЗначениеЗаполнено(Объект["Сделка"])
	Тогда
		Оповестить("ИзменениеДанныхОплатыКомплексногоРасчета", Новый Структура("Сделка", Объект["Сделка"]), Объект.Ссылка);
	КонецЕсли;
	
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчету"
		И Параметр = ЭтаФорма
	Тогда
		ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(РаботаСДокументамиКлиент.СделкаДокумента(Объект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОборудованиеДисплеиПокупателяКлиент.НачатьОчисткуДисплеяПокупателя(,УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// ПодключаемоеОборудование
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец ПодключаемоеОборудование
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ.

&НаКлиенте
Процедура КредитныеДанныеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияТиповЭУ()
	
	Элементы.Контрагент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.Сотрудник.ОграничениеТипа  = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	Элементы.Клиент.ОграничениеТипа     = Новый ОписаниеТипов("СправочникСсылка.Клиенты");
	Элементы.СтатьяЗатрат.ОграничениеТипа		= Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат");
	Элементы.КассаПолучатель.ОграничениеТипа	= Новый ОписаниеТипов("СправочникСсылка.Кассы");
	
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	СообщениеПользователю = КассаПриИзмененииСервер();
	Если ЗначениеЗаполнено(СообщениеПользователю) Тогда
		ПоказатьПредупреждение(,СообщениеПользователю, 30);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КассаПриИзмененииСервер()
	
	Если Не ПустаяСтрока(Объект.Номер) Тогда
		Об = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.РасходныйКассовыйОрдер"));
		ОбщегоНазначенияСервер.СброситьУстановленныйНомерОбъекта(Об, Объект.Номер);
		ЗначениеВДанныеФормы(Об, Объект);
	КонецЕсли;
	
	Возврат ОграничениеДоступаНаУровнеЗаписей.ТребуетсяПредупреждениеНесоответствияКассыФилиала(Объект.Касса, Объект.Филиал)
	
КонецФункции

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Объект.Контрагент, Объект.Выдать, Объект.ВыдатьИНН, Объект.ВыдатьАдрес);
	УстановитьПараметрыВыбораСделки();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Объект.Контрагент, Объект.Выдать, Объект.ВыдатьИНН, Объект.ВыдатьАдрес);

КонецПроцедуры

&НаКлиенте
Процедура СделкаПриИзменении(Элемент)
	Если Не Объект.ДокументОснование.Пустая() Тогда
		Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование,"Контрагент");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Чек(Команда)
	
	РаботаСДокументамиКлиент.ЧекДенежногоДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	Объект.ТелефонЧек = КонтактнаяИнформацияКлиент.ВыбратьСоздатьКИКлиента(Объект.Контрагент, ТипКИ, Объект.Филиал);
КонецПроцедуры

&НаКлиенте
Процедура КомандаEmail(Команда)
	ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
	Объект.АдресEmailЧек = КонтактнаяИнформацияКлиент.ВыбратьСоздатьКИКлиента(Объект.Контрагент, ТипКИ, Объект.Филиал);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораСделки()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.РасчетыСКлиентами") Тогда
		
		ЭлементСделка = Элементы.Найти("СделкаКлиент");
		Если ЭлементСделка <> Неопределено Тогда
			Параметр = Новый ПараметрВыбора("Отбор.Клиент", Объект.Контрагент);
			ПараметрыВыбораЗначения = Новый Массив;
			ПараметрыВыбораЗначения.Добавить(Параметр);
			
			ЭлементСделка.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ДействияФормыДействиеУстановитьОперациюСервер();
	УстановитьПараметрыВыбораСделки();
	
	РаботаСДокументамиКлиент.ОбновитьВидимостьДоступностьСпособаРасчетаККМ(ЭтаФорма, Объект.ВидОперации, Объект.СпособРасчетаЧекаККМ, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.СогласоватьЗначенияРеквизитовПоСпособуРасчета(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	
	Элементы.КредитныеДанныеДобавитьСертификат.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.РасчетыСКлиентами");
	
	///////////////////////////////////////////////////
	// ОМГ
	РеквизитыИнкасс();
	// ОМГ
    ///////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКомплексномуРасчету(Команда)
	ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(РаботаСДокументамиКлиент.СделкаДокумента(Объект));
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьОплатуКредитныхДанныхККМ(Команда)
	РаботаСДокументамиКлиентСервер.РаспределитьОплатуКредитныхДанныхККМ(Объект.КредитныеДанные, Объект.СуммаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НаУслуги", Истина);
		ПараметрыФормы.Вставить("НаОплату", Ложь);
		ПараметрыФормы.Вставить("СертификатыТолькоВладельца", Истина);
		ПараметрыФормы.Вставить("ВладелецСертификата", Объект.Контрагент);
		ПараметрыФормы.Вставить("ПроданныеСертификаты", Истина);
		ПараметрыФормы.Вставить("Дата", Объект.Дата);
		
		Оповещение = Новый ОписаниеОповещения("ДобавитьСертификат_Завершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Сертификаты.Форма.ФормаСпискаРасширеннаяУпр",ПараметрыФормы,ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Нельзя выбрать сертификат, т.к. не указан клиент!'"), 10);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.Сертификаты") Тогда
		
		СтруктураДанныхСертификата = ПолучитьСтруктуДанныхСтрокиСертификата(Результат);
		ЗаполнитьЗначенияСвойств(Объект.КредитныеДанные.Добавить(), СтруктураДанныхСертификата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаЧекаККМПриИзменении(Элемент)
	Если Объект.СпособРасчетаЧекаККМ = ПредопределенноеЗначение("Перечисление.СпособыРасчетаЧекаККМ.Аванс") Тогда
		Объект.КредитныеДанные.Очистить();
	КонецЕсли;
	
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.СогласоватьЗначенияРеквизитовПоСпособуРасчета(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеНоменклатураПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.КредитныеДанныеНоменклатураПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеСуммаПриИзменении(Элемент)
	ТД = Элементы.КредитныеДанные.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		РаботаСДокументамиКлиент.ЗаполнитьСуммуПриПокупкеСтрокиТабЧасти(ТД);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КредитныеДанныеНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РаботаСФормамиКлиент.УстановитьСписокДоступныхСтавокНДС(ДанныеВыбора, СтандартнаяОбработка, НастройкаПечатиЧеков, Объект.Филиал);
КонецПроцедуры

&НаКлиенте
Процедура СделкаКлиентПриИзменении(Элемент)
	Объект.КредитныеДанные.Очистить();
	РаботаСДокументамиКлиент.ПредложитьПерезаполнитьКредитныеДанныеПоСделкеДокумента(Объект, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОказаниюУслуг(Команда)
	ЗаполнитьПоОказаниюУслугСервер();	
	РаботаСДокументамиКлиент.РассчитатьЗаполнитьПризнакиДопСНОКредитнойЧасти(Объект, НастройкаПечатиЧеков);
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("Подключаемый_КнопкаФилиалПриНажатииЗавершение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма, , ОповещениеОВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатииЗавершение(Результат, ДополнительныеЗначения) Экспорт
	
	НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Объект.Филиал, Истина);
	ЗаполнитьДепозитнуюОперациюККМ();
	РаботаСДокументамиКлиент.ОбновитьВидимостьДоступностьСпособаРасчетаККМ(ЭтаФорма, Объект.ВидОперации, Объект.СпособРасчетаЧекаККМ, НастройкаПечатиЧеков);
	РаботаСДокументамиКлиент.ОбновитьВидимостьКредитныхДанныхККМ(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	РаботаСДокументамиКлиент.СогласоватьЗначенияРеквизитовПоСпособуРасчета(ЭтаФорма, Объект.ВидОперации, Объект.КредитныеДанные, Объект.СпособРасчетаЧекаККМ);
	
	СообщениеПользователю = ОграничениеДоступаНаУровнеЗаписей.ТребуетсяПредупреждениеНесоответствияКассыФилиала(Объект.Касса, Объект.Филиал);
	Если ЗначениеЗаполнено(СообщениеПользователю) Тогда
		ПоказатьПредупреждение(,СообщениеПользователю, 30);
	КонецЕсли;
	
	////////////////////////////////////////////////// 
	// ОМГ    
		Если Результат.ИсходныйФилиал <> Объект.Филиал Тогда
			ОМГ_ПереЗаполнитьОрганизацию(); 
		КонецЕсли;
	// ОМГ    
	/////////////////////////////////////////////////  
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(Сделка)
	
	Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Клиенты") Тогда
		Объект.СуммаДокумента = Макс(0, РаботаСКлиентамиПереопределяемый.ПолучитьВзаиморасчетыСКлиентом(Объект.Контрагент, ТекущаяДата(), Сделка));
	Иначе
		// Не будем изменять сумму документа	
	КонецЕсли;
	РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(Объект.Сделка, НастройкаПечатиЧеков, Объект.КредитныеДанные, Объект.СуммаДокумента);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДепозитнуюОперациюККМ()
	РаботаСДокументамиСервер.ЗаполнитьДепозитнуюОперациюККМ(Объект, НастройкаПечатиЧеков);
КонецФункции

&НаКлиенте
Процедура КредитныеДанныеПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.КредитныеДанныеПриИзменении(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОказаниюУслугСервер()
	РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоОказаниюУслуг(Объект.ДокументОснование, НастройкаПечатиЧеков, Объект.КредитныеДанные, Объект.СуммаДокумента, Объект.СпособРасчетаЧекаККМ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПолучателя(Команда)
	РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Объект.Контрагент, Объект.Выдать, Объект.ВыдатьИНН, Объект.ВыдатьАдрес, Истина);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоррекцияПриИзменении(Элемент)
	РаботаСДокументамиКлиент.ОбновитьВидимостьЭлементовКоррекции(ЭтаФорма, Объект.Коррекция);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРедактированиеРеквизитаККТ(НазваниеРеквизитаККТ)
	
	РаботаСДокументамиКлиент.ВыполнитьРедактированиеРеквизитаККТ(ЭтотОбъект, НазваниеРеквизитаККТ, Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПерсональныеДанныеПокупателяНажатие(Элемент)
	
	ВыполнитьРедактированиеРеквизитаККТ("ПерсональныеДанныеПокупателя");
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОперационныйРеквизитНажатие(Элемент)
	
	ВыполнитьРедактированиеРеквизитаККТ("ОперационныйРеквизит");
	
КонецПроцедуры

&наСервере
Процедура ПоместитьРеквизитыККТИзХЗвРеквизитыФормы()
	
	ОУОбъект = РеквизитФормыВЗначение("Объект");
	ПерсональныеДанныеПокупателя	= ОУОбъект.ПерсональныеДанныеПокупателя.Получить();
	ОперационныйРеквизит			= ОУОбъект.ОперационныйРеквизит.Получить();
	
КонецПроцедуры

&наСервере
Процедура ЗаписатьРеквизитыККТИзРеквизитовФормыВХЗ(ОУОбъект)
	
	ОУОбъект.ПерсональныеДанныеПокупателя	= Новый ХранилищеЗначения(ПерсональныеДанныеПокупателя);
	ОУОбъект.ОперационныйРеквизит			= Новый ХранилищеЗначения(ОперационныйРеквизит);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыРедактированияРеквизитаККТ(Результат, ПараметрыРеквизитаККТ) Экспорт
	
		Если Результат <> Неопределено Тогда
		Если Результат.Свойство("ДетальнаяИнформация") Тогда
			РаботаСДокументамиКлиент.СохранитьЗначениеРеквизитаККТВОбъекте(ЭтаФорма, Результат.ДетальнаяИнформация, ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ);
			Если ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ = "ПерсональныеДанныеПокупателя" Тогда
				Объект.Выдать = Результат.Клиент;
				Объект.ВыдатьИНН = Результат.ДетальнаяИнформация.ИНН;
				Объект.ВыдатьАдрес = Результат.Адрес;
			КонецЕсли;
		ИначеЕсли Результат.Свойство("Удалить") Тогда
			РаботаСДокументамиКлиент.ОчиститьЗначениеРеквизитаККТВОбъекте(ЭтаФорма, ПараметрыРеквизитаККТ.НазваниеРеквизитаККТ);	
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуДанныхСтрокиСертификата(Сертификат)
		
	Возврат Новый Структура("Номенклатура, Наименование", Сертификат.ВидСертификата.Номенклатура, Сертификат.ВидСертификата.Наименование);
	
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьПоДокументу(Команда)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.РасчетыСКлиентами") Тогда
		Объект.ПоДокументу = ПолучитьТекстПоДокументу(Объект.Контрагент, Объект.Дата);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстПоДокументу(Клиент, Дата)
	
	Результат = "";
	
	ПаспортныеДанные = РегистрыСведений.ПаспортныеДанные.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", Клиент));
	
	Если ЗначениеЗаполнено(ПаспортныеДанные.ДокументСерия) Или ЗначениеЗаполнено(ПаспортныеДанные.ДокументНомер) Тогда
		
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Результат, Строка(ПаспортныеДанные.ДокументВид),, Истина);
		
		Если ЗначениеЗаполнено(ПаспортныеДанные.ДокументСерия) Тогда
			ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Результат, "серия: " + ПаспортныеДанные.ДокументСерия, ", ");
		КонецЕсли;
		
		// Перевод первой буквы в верхний регистр.
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = ТРег(Сред(Результат, 1, 1)) + Прав(Результат, СтрДлина(Результат) - 1);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПаспортныеДанные.ДокументНомер) Тогда
			ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Результат, "№: " + ПаспортныеДанные.ДокументНомер, ", ");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПаспортныеДанные.ДокументДатаВыдачи) Тогда
			ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Результат, "выдан: " + Формат(ПаспортныеДанные.ДокументДатаВыдачи, "ДЛФ=DD"), ", ");
		КонецЕсли;
		
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Результат, ПаспортныеДанные.ДокументКемВыдан, " ", Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура омг_СделатьВозврат(Команда)
	
	ОписаниеОшибки = "";
	Если Объект.НомерЧекаККМ <> 0 Тогда
		//ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'"); 
		ТекстСообщения = "";
		РаботаСДокументамиКлиент.ПредложитьПечатьКопииЧекаПоДокументу(Объект.Ссылка, УникальныйИдентификатор, ТекстСообщения);
		Возврат;
	КонецЕсли;

	Омг_Подтверждение();

КонецПроцедуры        

&НаКлиенте
Процедура Омг_Подтверждение()
	Нал = Истина;	
    ЭтоПродажа = Ложь; 

	ВидОплаты = "Наличный";	

	ЭтоПродажа = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("Омг_ПослеЗакрытияВопроса",
	ЭтотОбъект,ВидОплаты);	
	ПоказатьВопрос(Оповещение,
	"Выдать?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, 
	"К выдаче " + Объект.СуммаДокумента + " тг."+ Символы.ПС+
	//"ОПЛАЧЕНО: "+ Объект.СуммаДокумента +" тг."+Символы.ПС+
	ВидОплаты +" " + Объект.СуммаДокумента +" тг."+ Символы.ПС+
	"ИТОГО "+ Объект.СуммаДокумента+" тг." 
	);     

КонецПроцедуры   


&НаКлиенте
Процедура Омг_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка 
			Записать();              
			НапечататьЧек(Истина);
		Исключение
		КонецПопытки;
		
		///////////////////////////////// временно удалить потом	
		Если Объект.омг_ВидОплаты = ПредопределенноеЗначение("Перечисление.омг_ВидыОплаты.Предоплата") Тогда
			омг_Предоплата.омг_СделатьВозвратПредоплаты(Объект.ДокументОснование,Объект);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры          

&НаКлиенте
Процедура НапечататьЧек(Пробить=Ложь)
	
	ОчиститьСообщения();
	
	ОписаниеОшибки = "";
	
	Если Объект.НомерЧекаККМ <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;
	КонецЕсли;
			
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда 
			Контекст = Новый Структура(); 			
			ОписаниеОповещения   = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение",ЭтотОбъект,Контекст);
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");			
			МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"),Пробить);
		Иначе
			ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	
КонецПроцедуры       
	
	&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
	ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
	
	Если ТипУстройства = "ККТ" Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор , ИдентификаторУстройства, Ложь);
	Иначе
		ПолучитьПараметрыЗавершение(Неопределено, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, Параметры,Пробить=Ложь) Экспорт
	
	ОписаниеОшибки = "";
	Если ПараметрыФискальногоУстройства =  Неопределено Тогда
		ВерсияФормата = "1.1.0.0";
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		ВерсияФормата = омг_WebKassa.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Параметры.ИдентификаторУстройства);
		НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		
		МассивЧеков = ПодготовитьДанныеДляПробитияЧека(НомерСекции, ВерсияФормата, ОписаниеОшибки);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание:
		|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли МассивЧеков.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Объект.НомерЧекаЭТ) и ЗначениеЗаполнено(Объект.омг_НомерТранзакцииТерминала) Тогда
		Пробить = Истина;	
		КонецЕсли; 	
			НапечататьЧекКлиент(МассивЧеков, Параметры.ИдентификаторУстройства, ВерсияФормата, Пробить);
	КонецЕсли;   
	
КонецПроцедуры   

&НаКлиенте
Процедура НапечататьЧекКлиент(МассивЧеков, ИдентификаторУстройства, ВерсияФормата,Пробить=Ложь)
	
	НомерСекции = 0;
	
	ЭтаФорма.Доступность = Ложь;
	Контекст = Новый Структура("ИдентификаторУстройства", ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НапечататьЧекКлиентЗавершение", ЭтотОбъект, Контекст);
	
	ПодключенноеОборудование = Новый Структура("Терминал, ФискальныеУстройства");
	ПодключенноеОборудование.ФискальныеУстройства = Новый Массив; 
	ПодключенноеОборудование.ФискальныеУстройства.Добавить(ИдентификаторУстройства);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыОперации.Вставить("Организация", омг_WebKassa.ПолучитьОрганизацию(Объект.Филиал));
	Если Объект.Свойство("Контрагент") Тогда
	ПараметрыОперации.Вставить("Партнер", Объект.Контрагент)
	ИначеЕсли Объект.Свойство("Клиент") Тогда
	ПараметрыОперации.Вставить("Партнер", Объект.Клиент)
	КонецЕсли;
	ПараметрыОперации.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);
	ПараметрыОперации.Вставить("ТорговыйОбъект", Неопределено);
	ПараметрыОперации.Вставить("Пробить", Пробить);
	
	ОткрытьФорму(
		"Обработка.ПечатьЧека.Форма",
		ПараметрыОперации,
		ЭтотОбъект,,,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекКлиентЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Если РезультатВыполнения = КодВозвратаДиалога.Отмена ИЛИ РезультатВыполнения = Неопределено Тогда
		// Отмена в форме печати чека
		ЭтаФорма.Доступность = Истина;
	ИначеЕсли РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Результат Тогда
		// Установить полученное значение номера чека реквизиту документа.
		ЭтаФорма.Доступность = Истина;
		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		Модифицированность  = Истина;
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)); 
		СуммаОплаты = Объект.СуммаДокумента;
		РаботаСДокументамиКлиентСервер.ВывестиЗаголовокСуммаОплатыДокумента(ЭтаФорма);  
		ЭтаФорма.Доступность = Истина; 
		Если Объект.омг_ВидОплаты = ПредопределенноеЗначение("Перечисление.омг_ВидыОплаты.Предоплата") Тогда
			омг_Предоплата.омг_СделатьВозвратПредоплаты(Объект.ДокументОснование,Объект);
		КонецЕсли;

	Иначе
		ЭтаФорма.Доступность = Истина;
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	//ФискальнаяОперацияОбновитьСтатус();
	//УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

 &НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(Знач НомерСекции, Знач ВерсияФормата, ОписаниеОшибки)

	Возврат Документы.РасходныйКассовыйОрдер.СобратьДанныеЧеков(Объект.Ссылка, НомерСекции, ВерсияФормата, ОписаниеОшибки);

КонецФункции            

////////////////////////////////////////////////// 
// ОМГ

&НаСервере
Процедура ОМГ_ПереЗаполнитьОрганизацию()
		
	Объект.Организация = омг_WebKassa.ПолучитьОрганизацию(Объект.Филиал);	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКупюры()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_НоминалыКупюр.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.омг_НоминалыКупюр КАК омг_НоминалыКупюр
		|
		|УПОРЯДОЧИТЬ ПО
		|	омг_НоминалыКупюр.Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрКупюры = Объект.омг_Купюры.Добавить();
		СтрКупюры.Номинал = ВыборкаДетальныеЗаписи.Ссылка
	КонецЦикла;
	  
КонецПроцедуры

&НаКлиенте
Процедура омг_КупюрыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура омг_КупюрыПередУдалением(Элемент, Отказ)
		
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура омг_КупюрыНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
		
	Выполнение = Ложь;

КонецПроцедуры 

&НаСервере
Процедура РеквизитыИнкасс()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк Тогда
	Элементы.омг_ИнкассГруппа.Видимость = Истина
	иначе
	Элементы.омг_ИнкассГруппа.Видимость = Ложь		
	КонецЕсли;	
	
КонецПроцедуры
// ОМГ    
/////////////////////////////////////////////////
